graphQL/app/graphql/types/query_type.rb

    def blog(id:)
      Blog.find_by(id: id)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]