zeeshan/graphql_app/app/graphql/types/blog_type.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def user_name
      "#{object.user.first_name} #{object.user.last_name}"