zeeshan/graphql_app/app/graphql/types/query_type.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def blog(id:)
      Blog.find(id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def user(id:)
      User.find(id)