Presentation_Project_Apps_Moin/graph_ql_api_app/graph_ql_api_app/app/graphql/types/item_type.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def artist
      # Here, you can implement the logic to fetch the associated artist for this item
      # For example, if you have an 'artist_id' field in your 'Item' model, you can do:
      # Item.find(object.id).artist
      # This assumes you have a proper association set up in your ActiveRecord models
      # Adjust this logic based on your specific implementation
      Item.find(object.id).artist