zeeshan/graphql_app/app/graphql/mutations/blog_create.rb

    def resolve(title:, description:, user_id:)
      blog = Blog.new(title: title, description: description, user_id: user_id)
      raise GraphQL::ExecutionError.new "Error creating blog", extensions: blog.errors.to_hash unless blog.save
---
INSERT INTO "blogs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["description", "testing"], ["user_id", 3], ["created_at", "2024-04-27 18:47:52.525551"], ["updated_at", "2024-04-27 18:47:52.525551"]]