zeeshan/graphql_app/app/graphql/mutations/blog_update.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "test1"], ["description", "Hello world"], ["updated_at", "2024-04-27 19:17:04.548253"], ["id", 22]]
---
    def resolve(id:, title:, description:)
      blog = ::Blog.find(id)
      raise GraphQL::ExecutionError.new "Error updating blog", extensions: blog.errors.to_hash unless blog.update(title: title, description: description)