Presentation_Project_Apps_Moin/rest_api_app/rest_api_app/app/controllers/api/v1/facts_controller.rb

SELECT "facts".* FROM "facts"
---
  def index
    @facts = Fact.all