zeeshan/graphql_app/app/models/blog.rb

SELECT 1 AS one FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."title" = $2 AND "blogs"."description" = $3 LIMIT $4  [["user_id", 3], ["title", "test1"], ["description", "testing"], ["LIMIT", 1]]
---
  def unique_blog_for_user
    if user.blogs.exists?(title: title, description: description)